/**
 * @file npc5.c
 * @ingroup NPCs
 *
 * @brief Unused Zelda follower NPC.
 */
#include "collision.h"
#include "functions.h"
#include "hitbox.h"
#include "message.h"
#include "npc.h"
#include "tiles.h"

#define kFollowDistance 32 // distance to follow player
#define kPoiDistance 4     // point of interest distance
#define kGravity Q_8_8(32.0)

#define kCloseDistance 48    // distance to player to walk slowly
#define kFarDistance 80      // distance to player to walk fast
#define kCloseSpeed 0x120    // speed when close to player
#define kMidSpeed 0x160      // speed when mid distance from player
#define kFarSpeed 0x220      // speed when far from player
#define kNavigateSpeed 0x1e0 // speed when navigating

#define FLAG_FLINCHING 0x1
#define FLAG_GOTO_PLAYER 0x2
#define FLAG_GOTO_JUMPED 0x4
#define FLAG_NAVIGATE 0x8

typedef enum {
    ZELDA_STATE_INIT,
    ZELDA_STATE_IDLE,
    ZELDA_STATE_FOLLOW,
    ZELDA_STATE_LOST,
    ZELDA_STATE_ANIM_SCRIPTED,
    ZELDA_STATE_WALK_PRE_JUMP,
    ZELDA_STATE_JUMP,
    ZELDA_STATE_LAND,
} ZeldaState;

#define HEAP ((ZeldaData*)super->myHeap)

typedef struct {
    /*0x00*/ Entity base;
    /*0x68*/ u16* messageData;
    /*0x6c*/ u8 baseAnimation;
    /*0x6d*/ u8 unused1;
    /*0x6e*/ u16 linear_move_dist;
    /*0x70*/ u8 unused2[4];
    /*0x74*/ u16 currentRoom;
    /*0x76*/ u8 unused3[2];
    /*0x78*/ Entity* interactEntity;
} NPC5Entity;

typedef struct {
    u8 flags;          // u8
    u8 followDistance; // u8
    u16 playerX;       // u16
    u16 playerY;       // u16
    u16 destX;
    u16 destY;
    u16 playerJumpedX; // u16
    u16 playerJumpedY; // u16
    u16 navX;          // u16
    u16 navY;          // u16
} ZeldaData;

void ZeldaSetAnim(NPC5Entity*, u32);

u32 CheckIsFlinching(NPC5Entity*);
u32 ZeldaAtDestination(Entity*);
void ZeldaUpdateIdleAnim(NPC5Entity*);
void ZeldaCalcWalkSpeed(NPC5Entity*, u32, u32);

bool32 CheckDirectPathUnblocked(Entity*, u32, u32);
void ZeldaInitNavigate(NPC5Entity*, u32, u32);
void ZeldaCalcWalkAnim(NPC5Entity*, u32, u32, u32);
bool32 ZeldaProcessMovement(NPC5Entity*);

void ZeldaDoLostAnim(NPC5Entity*);
void ZeldaUpdateAnim(Entity*);
void ZeldaType0Init(NPC5Entity*);
void ZeldaType1Init(NPC5Entity*);
void ZeldaType2Init(NPC5Entity*);
void ZeldaType3Init(NPC5Entity*);
void ZeldaInitAction(NPC5Entity*);
