/**
 * @file gleerok.c
 * @ingroup Enemies
 *
 * @brief Gleerok enemy
 */
#include "enemy.h"
#include "entity.h"
#include "functions.h"
#include "object.h"
#include "player.h"
#include "screen.h"

typedef struct {
    union SplitHWord unk0;
    u8 unk2;
    u8 unk3;
} Gleerok_HeapStruct2;

typedef struct {
    /*0x00*/ Gleerok_HeapStruct2 filler[6];
    /*0x00*/ Gleerok_HeapStruct2 filler2[5];
    /*0x2c*/ union SplitHWord unk_2c;
    /*0x2e*/ u16 filler_2e;
    /*0x30*/ u8 unk_30[6];
    /*0x36*/ u8 filler_36[0x2];
    /*0x38*/ Entity* entity1;
    /*0x3c*/ Entity* entities[5];
    /*0x50*/ Entity* ent2;
} Gleerok_HeapStruct;

typedef struct {
    Entity base;
    u8 filler[0xc];
    u8 unk_74;
    u8 unk_75;
    u8 unk_76;
    u8 unk_77;
    u8 unk_78;
    u8 unk_79;
    u8 unk_7a;
    u8 unk_7b;
    union SplitWord unk_7c;
    u8 unk_80;
    u8 unk_81;
    u8 unk_82;
    u8 unk_83;
    Gleerok_HeapStruct* unk_84;
} GleerokEntity;

extern void (*const Gleerok_Functions[])(GleerokEntity*);
extern void (*const gUnk_080CD75C[])(GleerokEntity*);
extern void (*const gUnk_080CD7B8[])(GleerokEntity*);
extern void (*const gUnk_080CD7E4[])(GleerokEntity*);
extern void (*const gUnk_080CD810[])(GleerokEntity*);
extern void (*const gUnk_080CD828[])(GleerokEntity*);
extern void (*const gUnk_080CD848[])(GleerokEntity*);

extern Gleerok_HeapStruct2 gUnk_080CD7C4[];
extern u8 gUnk_080CD884[];
extern u8 gUnk_080CD7F8[];
extern u8 gUnk_080CD840[];
extern u8 gUnk_080CD844[];
extern u8 gUnk_080CD850[];
extern u8 gUnk_080CD854[];
extern const u8* gUnk_080CD86C[];
