/**
 * @file mazaalBracelet.c
 * @ingroup Enemies
 *
 * @brief Mazaal Bracelet enemy
 */
#include "enemy.h"
#include "functions.h"
#include "hitbox.h"
#include "object.h"

typedef struct MazaalBraceletEntity_ {
    /*0x00*/ Entity base;
    /*0x68*/ u8 unused1[12];
    union {
        /*0x74*/ struct MazaalBraceletEntity_* entity;
        /*0x74*/ u16 u16;
        struct {
            /*0x74*/ u8 unk_74;
            /*0x75*/ u8 unk_75;
        } split;
    } unk_74;
    union {
        /*0x78*/ struct MazaalBraceletEntity_* entity;
        struct {
            /*0x78*/ u16 unk_78;
        } split;
    } unk_78;
    /*0x7c*/ union SplitHWord unk_7c;
    /*0x7e*/ u16 unk_7e;
    /*0x80*/ union SplitHWord unk_80;
    /*0x82*/ u8 unused4[2];
    /*0x84*/ u8 unk_84;
} MazaalBraceletEntity;

extern void SoundReqClipped(Entity*, u32);

void sub_0803B538(MazaalBraceletEntity*);
bool32 sub_0803B4E4(MazaalBraceletEntity*);
void sub_0803B55C(MazaalBraceletEntity*);
void sub_0803B4D4(MazaalBraceletEntity*);
void sub_0803B59C(MazaalBraceletEntity*);
void sub_0803B5C0(MazaalBraceletEntity*);
u32 sub_0803B610(MazaalBraceletEntity*);
void sub_0803B63C(MazaalBraceletEntity*);
void sub_0803B6A4(MazaalBraceletEntity*);
bool32 sub_0803B6F4(MazaalBraceletEntity*);
void sub_0803B8E8(MazaalBraceletEntity*, u32);
u32 sub_0803B870(MazaalBraceletEntity*);
void sub_0803B824(MazaalBraceletEntity*);
void sub_0803B804(MazaalBraceletEntity*);
void sub_0803B798(void);
void sub_0803BA8C(MazaalBraceletEntity*, u32);

void sub_0803B724(MazaalBraceletEntity*);

void MazaalBracelet_OnTick(MazaalBraceletEntity*);
void MazaalBracelet_OnCollision(MazaalBraceletEntity*);
void MazaalBracelet_OnGrabbed(MazaalBraceletEntity*);
