/**
 * @file vaatiArm.c
 * @ingroup Enemies
 *
 * @brief Vaati Arm enemy
 */
#include "area.h"
#include "enemy.h"
#include "functions.h"
#include "hitbox.h"
#include "object.h"
#include "roomid.h"

typedef struct {
    /*0x00*/ Entity base;
    /*0x68*/ Entity* unk_68;
    /*0x6c*/ u8 unused1[12];
    /*0x78*/ u8 unk_78;
    /*0x79*/ u8 unk_79;
    /*0x7a*/ u16 unk_7a;
    /*0x7c*/ u8 unk_7c;
    /*0x7d*/ u8 unk_7d;
    /*0x7e*/ u8 unk_7e;
    /*0x7f*/ u8 unk_7f;
} VaatiArmEntity;

typedef struct VaatiArm_HeapStruct1 {
    union SplitHWord unk00;
    u16 unk02;
    union SplitHWord unk04;
    u16 unk06;
    s16 unk08;
    s16 unk0a;
    u8 unk0c;
    u8 unk0d;
    u8 unk0e;
    u8 unk0f;
} VaatiArm_HeapStruct1;

typedef struct VaatiArm_HeapStruct {
    VaatiArmEntity* entities[5];
    Entity* parent;
    VaatiArm_HeapStruct1 s1[5];
} VaatiArm_HeapStruct;

extern void EnemyDetachFX(Entity*);

static u32 sub_080437DC(VaatiArmEntity*);
static bool32 sub_08043C98(VaatiArmEntity*);
static void VaatiArm_OnTick(VaatiArmEntity*);
static void VaatiArm_OnCollision(VaatiArmEntity*);
static void sub_080425B4(VaatiArmEntity*);
static void sub_08042818(VaatiArmEntity*);
static void sub_08042870(VaatiArmEntity*);
static void sub_08042A3C(VaatiArmEntity*);
static void sub_08042C14(VaatiArmEntity*);
static void sub_0804325C(VaatiArmEntity*);
static void sub_08043420(VaatiArmEntity*);
static void sub_08043680(VaatiArmEntity*);
