/**
 * @file vaatiTransfigured.c
 * @ingroup Enemies
 *
 * @brief Vaati Transfigured enemy
 */
#include "enemy.h"
#include "functions.h"
#include "object.h"

typedef struct {
    /*0x00*/ Entity base;
    /*0x68*/ u8 unused1[5];
    /*0x6d*/ u8 unk_6d;
    /*0x6e*/ u8 unused2[6];
    /*0x74*/ u8 unk_74;
    /*0x75*/ u8 unk_75;
    /*0x76*/ u8 unk_76;
    /*0x77*/ u8 unk_77;
    /*0x78*/ u16 unk_78;
    /*0x7a*/ u16 unk_7a;
    /*0x7c*/ u16 unk_7c;
    /*0x7e*/ u16 unk_7e;
    /*0x80*/ u8 unk_80;
    /*0x81*/ u8 unk_81;
    /*0x82*/ u8 unk_82;
    /*0x83*/ u8 unused3[1];
    /*0x84*/ u8 unk_84;
    /*0x85*/ u8 unused4[1];
    /*0x86*/ u8 unk_86;
    /*0x87*/ u8 unk_87;
} VaatiTransfiguredEntity;

extern void Knockback1(Entity*);

void sub_080409B0(VaatiTransfiguredEntity*);
void sub_080408EC(VaatiTransfiguredEntity*);
void sub_08040AD4(VaatiTransfiguredEntity*);
void sub_08040670(VaatiTransfiguredEntity*);
void sub_080406A0(VaatiTransfiguredEntity*);
void sub_08040770(VaatiTransfiguredEntity*);
u32 sub_08040934(VaatiTransfiguredEntity*);
void sub_08040648(VaatiTransfiguredEntity*, u32, u32);

void VaatiTransfiguredType0Action0(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action1(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action2(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action3(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action4(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action5(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action6(VaatiTransfiguredEntity*);
void VaatiTransfiguredType0Action7(VaatiTransfiguredEntity*);
